{
    "count": 87709,
    "items": [
        {
            "id": 1060636,
            "from_id": -20629724,
            "owner_id": -20629724,
            "date": 1522267557,
            "marked_as_ads": 0,
            "post_type": "post",
            "text": "Softer Meetup. Как правильно иметь дело с User Story?\n\nВ четверг, 29 марта (уже завтра!), в офисе сервиса путешествий Туту.ру пройдет очередной Softer Meetup. Обсудим, как на самом деле нужно записывать требования в виде (User) Story и работать с ними, оставаясь в согласии с принципами и ценностями Agile. Читать дальше → https://goo.gl/xfLv8p",
            "attachments": [
                {
                    "type": "link",
                    "link": {
                        "url": "https://goo.gl/xfLv8p",
                        "title": "Softer Meetup. Как правильно иметь дело с User Story?",
                        "description": "В четверг, 29 марта (уже завтра!), в офисе сервиса путешествий Туту.ру пройдет очередной Softer Meetup. Обсудим, как на самом деле нужно записывать требования...",
                        "target": "internal",
                        "image_src": "https://pp.userapi.com/c840326/v840326445/6f220/_3mhIpujxBI.jpg",
                        "image_big": "https://pp.userapi.com/c840326/v840326445/6f21f/mVD3Yv0DbVg.jpg"
                    }
                }
            ],
            "post_source": {
                "type": "api"
            },
            "comments": {
                "count": 0,
                "can_post": 1
            },
            "likes": {
                "count": 7,
                "user_likes": 0,
                "can_like": 1,
                "can_publish": 1
            },
            "reposts": {
                "count": 2,
                "user_reposted": 0
            }
        },
        {
            "id": 1060635,
            "from_id": -20629724,
            "owner_id": -20629724,
            "date": 1522267555,
            "marked_as_ads": 0,
            "post_type": "post",
            "text": "[Перевод] Алан Кей и Марвин Мински: Computer Science уже имеет «грамматику». Нужна «литература»\n\nПервый слева — Марвин Мински, второй слева — Алан Кей, потом Джон Перри Барлоу и Глория Мински.\n\nВопрос: Как бы вы интерпретировали идею Марвина Мински о том, что «Computer Science уже имеет грамматику. Что ей нужно так это литература.»?\n\nАлан Кей: Самый интересный аспект записи блога Кена (включая комментарии) заключается в том, что нигде нельзя найти историческое упоминание этой идеи. Фактически, более 50 лет назад в 60-х годах по этому поводу было много разговоров и, насколько я помню, несколько статей. \n\nЯ впервые услышал об этой идее от Боба Бартона, в 1967 году в магистратуре, тогда он сказал мне, что эта идея была частью мотивации Дональда Кнута, когда он писал “Искусство программирования”, главы которого уже ходили по рукам. Один из главных вопросов Боба тогда был о «языках программирования, предназначенных для чтения людьми также как и машинами». И это было основной мотивацией для частей дизайна COBOL в начале 60-х годов. И, возможно, что более важно в контексте нашей темы, эта идея видна в очень раннем и довольно красиво разработанном интерактивном языке JOSS (в основном Cliff Shaw).\n\nКак заметил Фрэнк Смит, литература начинается с идей, которые стоит обсуждать и записывать; она часто частично генерирует представления и расширяет существующие языки и формы; это приводит к новым идеям о чтении и письме; и, наконец, к новым идеям, которые не были частью первоначального мотива. Читать дальше → https://goo.gl/Qn9hSS",
            "attachments": [
                {
                    "type": "link",
                    "link": {
                        "url": "https://goo.gl/Qn9hSS",
                        "title": "Алан Кей и Марвин Мински: Computer Science уже имеет «грамматику». Нужна «литература»",
                        "description": "Первый слева — Марвин Мински, второй слева — Алан Кей, потом Джон Перри Барлоу и Глория Мински. Вопрос: Как бы вы интерпретировали идею Марвина Мински о том,...",
                        "target": "internal",
                        "image_src": "https://pp.userapi.com/c840334/v840334445/6f38e/RcKl5GqgLys.jpg",
                        "image_big": "https://pp.userapi.com/c840334/v840334445/6f38d/FeKu3kX5VXY.jpg"
                    }
                }
            ],
            "post_source": {
                "type": "api"
            },
            "comments": {
                "count": 0,
                "can_post": 1
            },
            "likes": {
                "count": 4,
                "user_likes": 0,
                "can_like": 1,
                "can_publish": 1
            },
            "reposts": {
                "count": 0,
                "user_reposted": 0
            }
        }
    ]
}